apache/nuttx/arch/arm/src/s32k3xx/s32k3xx_lpi2c.c
  if (priv->rxdma != NULL || priv->txdma != NULL)
    {
      /* Condition the status with only the enabled interrupts */

      status &= s32k3xx_lpi2c_getenabledints(priv);

      /* Is there an Error condition */

      if (current_status & LPI2C_MSR_LIMITED_ERROR_MASK)
        {
          s32k3xx_lpi2c_traceevent(priv, I2CEVENT_ERROR, 0);

          /* Return the full error status */

          priv->status = current_status;
        }

      /* End of packet or Stop */

      if ((status & (LPI2C_MSR_SDF | LPI2C_MSR_EPF)) != 0)
        {
          s32k3xx_lpi2c_traceevent(priv, I2CEVENT_STOP, 0);

          /* Acknowledge End of packet or Stop */

          s32k3xx_lpi2c_putreg(priv, S32K3XX_LPI2C_MSR_OFFSET, status &
                                                           (LPI2C_MSR_SDF |
                                                           LPI2C_MSR_EPF));

          /* Mark that this transaction stopped */

          priv->msgv = NULL;
          priv->msgc = 0;
          priv->dcnt = -1;

          if (priv->intstate == INTSTATE_WAITING)
            {
              /* inform the thread that transfer is complete
               * and wake it up
               */

              s32k3xx_dmach_stop(priv->txdma);
              s32k3xx_dmach_stop(priv->rxdma);

              priv->intstate = INTSTATE_DONE;
              nxsem_post(&priv->sem_isr);
            }
        }

      /* Clear the error */

      s32k3xx_lpi2c_putreg(priv, S32K3XX_LPI2C_MSR_OFFSET,
                        (current_status & (LPI2C_MSR_NDF |
                                           LPI2C_MSR_ALF |
                                           LPI2C_MSR_FEF)));
      return OK;
    }

#endif
  /* Check for new trace setup */

  s32k3xx_lpi2c_tracenew(priv, status);

  if ((status & LPI2C_MSR_LIMITED_ERROR_MASK) == 0)
    {
      /* Check if there is more bytes to send */

      if (((priv->flags & I2C_M_READ) == 0) &&
               (status & LPI2C_MSR_TDF) != 0)
        {
          if (priv->dcnt > 0)
            {
              s32k3xx_lpi2c_traceevent(priv, I2CEVENT_SENDBYTE, priv->dcnt);
              s32k3xx_lpi2c_putreg(priv, S32K3XX_LPI2C_MTDR_OFFSET,
                                 LPI2C_MTDR_CMD_TXD |
                                 LPI2C_MTDR_DATA(*priv->ptr++));
              priv->dcnt--;

              /* Last byte of last message? */

              if ((priv->msgc <= 0) && (priv->dcnt == 0))
                {
                  if ((priv->flags & I2C_M_NOSTOP) == 0)
                    {
                      s32k3xx_lpi2c_traceevent(priv, I2CEVENT_STOP, 0);

                      /* Do this once */

                      priv->flags |= I2C_M_NOSTOP;
                      s32k3xx_lpi2c_sendstop(priv);
                    }
                }
            }
        }

      /* Check if there is more bytes to read */

      else if (((priv->flags & I2C_M_READ) != 0) &&
               (status & LPI2C_MSR_RDF) != 0)
        {
          /* Read a byte, if dcnt goes < 0, read dummy bytes to ack ISRs */

          if (priv->dcnt > 0)
            {
              s32k3xx_lpi2c_traceevent(priv, I2CEVENT_RCVBYTE, priv->dcnt);

              /* No interrupts or context switches should occur in the
               * following sequence. Otherwise, additional bytes may be
               * sent by the device.
               */

    #ifdef CONFIG_I2C_POLLED
              irqstate_t flags = enter_critical_section();
    #endif

              /* Receive a byte */

              *priv->ptr++ = s32k3xx_lpi2c_getreg(priv,
                                                S32K3XX_LPI2C_MRDR_OFFSET) &
                                                LPI2C_MRDR_DATA_MASK;
              priv->dcnt--;

    #ifdef CONFIG_I2C_POLLED
              leave_critical_section(flags);
    #endif
              /* Last byte of last message? */

              if ((priv->msgc <= 0) && (priv->dcnt == 0))
                {
                  if ((priv->flags & I2C_M_NOSTOP) == 0)
                    {
                      s32k3xx_lpi2c_traceevent(priv, I2CEVENT_STOP, 0);

                      /* Do this once */

                      priv->flags |= I2C_M_NOSTOP;
                      s32k3xx_lpi2c_sendstop(priv);
                    }
                }
            }
          else
            {
              /* Read and discard data */

              s32k3xx_lpi2c_getreg(priv, S32K3XX_LPI2C_MRDR_OFFSET);
            }
        }

      /* Start the first or next message */

      if (priv->dcnt <= 0 && (status & (LPI2C_MSR_EPF | LPI2C_MSR_SDF)) == 0)
        {
          if (priv->msgc > 0 && priv->msgv != NULL)
            {
              priv->ptr   = priv->msgv->buffer;
              priv->dcnt  = priv->msgv->length;
              priv->flags = priv->msgv->flags;

              if ((priv->flags & I2C_M_NOSTART) == 0)
                {
                  s32k3xx_lpi2c_traceevent(priv, I2CEVENT_STARTRESTART,
                                         priv->msgc);

                  /* Do this once */

                  priv->flags |= I2C_M_NOSTART;

                  s32k3xx_lpi2c_sendstart(priv, priv->msgv->addr);
                }
              else
                {
                  s32k3xx_lpi2c_traceevent(priv, I2CEVENT_NOSTART,
                                           priv->msgc);
                }

              priv->msgv++;
              priv->msgc--;

              if ((priv->flags & I2C_M_READ) != 0)
                {
#ifndef CONFIG_I2C_POLLED
                  /* Stop TX interrupt */

                  s32k3xx_lpi2c_modifyreg(priv, S32K3XX_LPI2C_MIER_OFFSET,
                                        LPI2C_MIER_TDIE, LPI2C_MIER_RDIE);
#endif
                  /* Set LPI2C in read mode */

                  s32k3xx_lpi2c_putreg(priv, S32K3XX_LPI2C_MTDR_OFFSET,
                                     LPI2C_MTDR_CMD_RXD |
                                     LPI2C_MTDR_DATA((priv->dcnt - 1)));
                }
              else
                {
                  /* Send the first byte from tx buffer */

                  s32k3xx_lpi2c_traceevent(priv, I2CEVENT_SENDBYTE,
                                         priv->dcnt);
                  s32k3xx_lpi2c_putreg(priv, S32K3XX_LPI2C_MTDR_OFFSET,
                                     LPI2C_MTDR_CMD_TXD |
                                     LPI2C_MTDR_DATA(*priv->ptr++));
                  priv->dcnt--;

