apache/nuttx/arch/arm/src/s32k3xx/s32k3xx_lpi2c.c
                  /* Last byte of last message? */

                  if ((priv->msgc <= 0) && (priv->dcnt == 0))
                    {
                      if ((priv->flags & I2C_M_NOSTOP) == 0)
                        {
                          s32k3xx_lpi2c_traceevent(priv, I2CEVENT_STOP, 0);

                          /* Do this once */

                          priv->flags |= I2C_M_NOSTOP;
                          s32k3xx_lpi2c_sendstop(priv);
                        }
                    }
                }
            }
        }
    }
  else
    {
      s32k3xx_lpi2c_traceevent(priv, I2CEVENT_ERROR, 0);

      priv->status = status;

      if ((priv->flags & I2C_M_NOSTOP) == 0)
        {
          s32k3xx_lpi2c_traceevent(priv, I2CEVENT_STOP, 0);

          /* Do this once */

          priv->flags |= I2C_M_NOSTOP;
          s32k3xx_lpi2c_sendstop(priv);
        }

      /* Clear the error */

      s32k3xx_lpi2c_putreg(priv, S32K3XX_LPI2C_MSR_OFFSET,
                           (status & (LPI2C_MSR_NDF | LPI2C_MSR_ALF |
                                      LPI2C_MSR_FEF | LPI2C_MSR_EPF)));
    }

  /* Check for endof packet or Stop */

  if ((status & (LPI2C_MSR_EPF | LPI2C_MSR_SDF)) != 0)
    {
      /* Reset either or both */

      s32k3xx_lpi2c_putreg(priv, S32K3XX_LPI2C_MSR_OFFSET, status &
                           (LPI2C_MSR_EPF | LPI2C_MSR_SDF));

      /* Was it both End of packet and Stop */

      if ((status & (LPI2C_MSR_EPF | LPI2C_MSR_SDF)) ==
          (LPI2C_MSR_EPF | LPI2C_MSR_SDF))
        {
#ifndef CONFIG_I2C_POLLED
          if (priv->intstate == INTSTATE_WAITING)
            {
              /* inform the thread that transfer is complete
               * and wake it up
               */

              priv->intstate = INTSTATE_DONE;

              s32k3xx_lpi2c_modifyreg(priv, S32K3XX_LPI2C_MIER_OFFSET,
                                   LPI2C_MIER_TDIE | LPI2C_MIER_RDIE |
                                   LPI2C_MIER_NDIE | LPI2C_MIER_ALIE |
                                   LPI2C_MIER_SDIE | LPI2C_MIER_EPIE, 0);
              nxsem_post(&priv->sem_isr);
            }
#else
          priv->intstate = INTSTATE_DONE;
#endif
        }
    }

  return OK;
}

/****************************************************************************
 * Name: s32k3xx_lpi2c_isr
 *
 * Description:
 *   Common I2C interrupt service routine
 *
 ****************************************************************************/

#ifndef CONFIG_I2C_POLLED
static int s32k3xx_lpi2c_isr(int irq, void *context, void *arg)
{
  struct s32k3xx_lpi2c_priv_s *priv = (struct s32k3xx_lpi2c_priv_s *)arg;

  DEBUGASSERT(priv != NULL);
  return s32k3xx_lpi2c_isr_process(priv);
}
#endif

/****************************************************************************
 * Name: s32k3xx_lpi2c_init
 *
 * Description:
 *   Setup the I2C hardware, ready for operation with defaults
 *
 ****************************************************************************/

static int s32k3xx_lpi2c_init(struct s32k3xx_lpi2c_priv_s *priv)
{
  /* Power-up and configure GPIOs .
   *
   * NOTE: Clocking to the LPI2C peripheral must be provided by
   * board-specific logic as part of the clock configuration logic.
   */

  /* Configure pins */

  s32k3xx_pinconfig(priv->config->scl_pin);
  s32k3xx_pinconfig(priv->config->sda_pin);

  /* Reset LPI2C before configuring it */

  s32k3xx_lpi2c_putreg(priv, S32K3XX_LPI2C_MCR_OFFSET, LPI2C_MCR_RST);
  s32k3xx_lpi2c_putreg(priv, S32K3XX_LPI2C_MCR_OFFSET, 0);

  /* Disable doze mode (Set DOZEN bit in 1 to disable) */

  s32k3xx_lpi2c_putreg(priv, S32K3XX_LPI2C_MCR_OFFSET, LPI2C_MCR_DOZEN);

  /* Disable host request */

  s32k3xx_lpi2c_modifyreg(priv, S32K3XX_LPI2C_MCFGR0_OFFSET,
                        LPI2C_MCFGR0_HREN | LPI2C_MCFGR0_HRSEL,
                        LPI2C_MCFGR0_HRPOL);

  /* Pin config and ignore NACK disable */

  s32k3xx_lpi2c_modifyreg(priv, S32K3XX_LPI2C_MCFGR1_OFFSET,
                        LPI2C_MCFGR1_IGNACK | LPI2C_MCFGR1_PINCFG_MASK, 0);

  /* Set tx and rx watermarks */

  s32k3xx_lpi2c_putreg(priv, S32K3XX_LPI2C_MFCR_OFFSET,
                       LPI2C_MFCR_TXWATER(0) | LPI2C_MFCR_RXWATER(0));

  /* Force a frequency update */

  priv->frequency = 0;
  s32k3xx_lpi2c_setclock(priv, 100000);

  /* Set scl, sda glitch filters and busy idle */

  s32k3xx_lpi2c_putreg(priv, S32K3XX_LPI2C_MCFGR2_OFFSET,
                       LPI2C_MCFGR2_BUSIDLE(priv->config->busy_idle) |
                       LPI2C_MCFGR2_FILTSCL_CYCLES(priv->config->filtscl) |
                       LPI2C_MCFGR2_FILTSDA_CYCLES(priv->config->filtsda));

  /* Set pin low cycles to 0 (disable) */

  s32k3xx_lpi2c_putreg(priv, S32K3XX_LPI2C_MCFGR3_OFFSET,
                       LPI2C_MCFGR3_PINLOW_CYCLES(0));

  /* Attach ISRs */

#ifndef CONFIG_I2C_POLLED
  irq_attach(priv->config->irq, s32k3xx_lpi2c_isr, priv);
  up_enable_irq(priv->config->irq);
#endif

  /* Enable I2C */

  s32k3xx_lpi2c_modifyreg(priv, S32K3XX_LPI2C_MCR_OFFSET, 0, LPI2C_MCR_MEN);
  return OK;
}

/****************************************************************************
 * Name: s32k3xx_lpi2c_deinit
 *
 * Description:
 *   Shutdown the I2C hardware
 *
 ****************************************************************************/

static int s32k3xx_lpi2c_deinit(struct s32k3xx_lpi2c_priv_s *priv)
{
  /* Disable I2C */

  s32k3xx_lpi2c_modifyreg(priv, S32K3XX_LPI2C_MCR_OFFSET, LPI2C_MCR_MEN, 0);

  /* Reset LPI2C */

  s32k3xx_lpi2c_putreg(priv, S32K3XX_LPI2C_MCR_OFFSET, LPI2C_MCR_RST);
  s32k3xx_lpi2c_putreg(priv, S32K3XX_LPI2C_MCR_OFFSET, 0);

  /* Disable and detach interrupts */

#ifndef CONFIG_I2C_POLLED
  up_disable_irq(priv->config->irq);
  irq_detach(priv->config->irq);
#endif

  /* NOTE that clocking is left enabled. */

  return OK;
}

/****************************************************************************
 * Device Driver Operations
 ****************************************************************************/

/****************************************************************************
 * Name: s32k3xx_lpi2c_dma_command_configure
 *
 * Description:
 *   Create a command TCD
 *
 ****************************************************************************/

#ifdef CONFIG_S32K3XX_LPI2C_DMA
static int
s32k3xx_lpi2c_dma_command_configure(struct s32k3xx_lpi2c_priv_s
                                    *priv, uint16_t *ccmd,
                                     uint32_t ncmd)
{
  struct s32k3xx_edma_xfrconfig_s config;
  memset(&config, 0, sizeof(config));

  config.saddr  = (uint32_t) ccmd;
  config.daddr  = priv->config->base + S32K3XX_LPI2C_MTDR_OFFSET;
  config.soff   = sizeof(uint16_t);
  config.doff   = 0;
  config.iter   = 1;
  config.flags  = EDMA_CONFIG_LINKTYPE_LINKNONE;
  config.ssize  = EDMA_16BIT;
  config.dsize  = EDMA_16BIT;
  config.nbytes = sizeof(uint16_t) * ncmd;

  up_clean_dcache((uintptr_t)config.saddr,
                  (uintptr_t)config.saddr + config.nbytes);

  return s32k3xx_dmach_xfrsetup(priv->txdma, &config);
}
#endif

/****************************************************************************
 * Name: s32k3xx_lpi2c_dma_data_configure
 *
 * Description:
 *   Create a data TCD
 *
 ****************************************************************************/

#ifdef CONFIG_S32K3XX_LPI2C_DMA
static int s32k3xx_lpi2c_dma_data_configure(struct s32k3xx_lpi2c_priv_s
                                              *priv,
                                              struct i2c_msg_s *msg)
{
  DMACH_HANDLE dma;
  struct s32k3xx_edma_xfrconfig_s config;
  memset(&config, 0, sizeof(config));

  config.iter   = msg->length;
  config.flags  = EDMA_CONFIG_LINKTYPE_LINKNONE;
  config.ssize  = EDMA_8BIT;
  config.dsize  = EDMA_8BIT;
  config.nbytes = sizeof(msg->buffer[0]);

  if (msg->flags & I2C_M_READ)
    {
      dma           = priv->rxdma;
      config.saddr  = priv->config->base + S32K3XX_LPI2C_MRDR_OFFSET;
      config.daddr  = (uint32_t) msg->buffer;
      config.soff   = 0;
      config.doff   = sizeof(msg->buffer[0]);
    }
  else
    {
      dma           = priv->txdma;
      config.saddr  = (uint32_t) msg->buffer;
      config.daddr  = priv->config->base + S32K3XX_LPI2C_MTDR_OFFSET;
      config.soff   = sizeof(msg->buffer[0]);
      config.doff   = 0;
      up_clean_dcache((uintptr_t)msg->buffer,
                      (uintptr_t)msg->buffer + msg->length);
    }

  return s32k3xx_dmach_xfrsetup(dma, &config) ? 0 : msg->length;
}
#endif

/****************************************************************************
 * Name: s32k3xx_lpi2c_form_command_list
 *
 * Description:
 *   Form the DMA command list
 *
 ****************************************************************************/

#ifdef CONFIG_S32K3XX_LPI2C_DMA
static int s32k3xx_lpi2c_form_command_list(struct s32k3xx_lpi2c_priv_s
                                              *priv, struct i2c_msg_s *msg,
                                              int ncmds)
{
  ssize_t length = 0;

  if (priv->flags & I2C_M_NOSTART)
    {
      if (priv->flags & I2C_M_READ)
        {
          /* No start read operation */

          priv->cmnds[ncmds++] = LPI2C_MTDR_CMD_RXD |
                                 LPI2C_MTDR_DATA(msg->length - 1);
        }
    }
  else
    {
      /* A start based read or write operation */

      /* Create bus address with R/W */

      uint16_t badd = (priv->flags & I2C_M_READ) ? I2C_READADDR8(msg->addr) :
                                                   I2C_WRITEADDR8(msg->addr);

