apache/nuttx/arch/arm/src/s32k3xx/s32k3xx_lpi2c.c
  s32k3xx_lpi2c_tracedump(priv);

  /* Ensure that any ISR happening after we finish can't overwrite any user
   * data.
   */

  priv->dcnt = 0;
  priv->ptr = NULL;

#ifdef CONFIG_S32K3XX_LPI2C_DMA
  if (priv->rxdma)
    {
      for (m = 0; m < count; m++)
        {
          if (msgs[m].flags & I2C_M_READ)
            {
            up_invalidate_dcache((uintptr_t)msgs[m].buffer,
                                (uintptr_t)msgs[m].buffer + msgs[m].length);
            }
        }
    }
#endif

  nxmutex_unlock(&priv->lock);
  return ret;
}

/****************************************************************************
 * Name: s32k3xx_lpi2c_reset
 *
 * Description:
 *   Perform an I2C bus reset in an attempt to break loose stuck I2C devices.
 *
 * Input Parameters:
 *   dev   - Device-specific state data
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno value on failure.
 *
 ****************************************************************************/

#ifdef CONFIG_I2C_RESET
static int s32k3xx_lpi2c_reset(struct i2c_master_s *dev)
{
  struct s32k3xx_lpi2c_priv_s *priv = (struct s32k3xx_lpi2c_priv_s *)dev;
  unsigned int clock_count;
  unsigned int stretch_count;
  uint32_t scl_gpio;
  uint32_t sda_gpio;
  uint32_t frequency;
  int ret;

  DEBUGASSERT(dev);

  /* Our caller must own a ref */

  DEBUGASSERT(priv->refs > 0);

  /* Lock out other clients */

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  ret = -EIO;

  /* Save the current frequency */

  frequency = priv->frequency;

  /* De-init the port */

  s32k3xx_lpi2c_deinit(priv);

  /* Use GPIO configuration to un-wedge the bus */

  scl_gpio = MKI2C_OUTPUT(priv->config->scl_pin);
  sda_gpio = MKI2C_OUTPUT(priv->config->sda_pin);

  s32k3xx_pinconfig(scl_gpio);
  s32k3xx_pinconfig(sda_gpio);

  /* Let SDA go high */

  s32k3xx_gpiowrite(sda_gpio, 1);

  /* Clock the bus until any slaves currently driving it let it go. */

  clock_count = 0;
  while (!s32k3xx_gpioread(sda_gpio))
    {
      /* Give up if we have tried too hard */

      if (clock_count++ > 10)
        {
          goto out;
        }

      /* Sniff to make sure that clock stretching has finished.
       *
       * If the bus never relaxes, the reset has failed.
       */

      stretch_count = 0;
      while (!s32k3xx_gpioread(scl_gpio))
        {
          /* Give up if we have tried too hard */

          if (stretch_count++ > 10)
            {
              goto out;
            }

          up_udelay(10);
        }

      /* Drive SCL low */

      s32k3xx_gpiowrite(scl_gpio, 0);
      up_udelay(10);

      /* Drive SCL high again */

      s32k3xx_gpiowrite(scl_gpio, 1);
      up_udelay(10);
    }

  /* Generate a start followed by a stop to reset slave
   * state machines.
   */

  s32k3xx_gpiowrite(sda_gpio, 0);
  up_udelay(10);
  s32k3xx_gpiowrite(scl_gpio, 0);
  up_udelay(10);
  s32k3xx_gpiowrite(scl_gpio, 1);
  up_udelay(10);
  s32k3xx_gpiowrite(sda_gpio, 1);
  up_udelay(10);

  /* Revert the GPIO configuration. */

  sda_gpio = MKI2C_INPUT(sda_gpio);
  scl_gpio = MKI2C_INPUT(scl_gpio);

  s32k3xx_pinconfig(sda_gpio);
  s32k3xx_pinconfig(scl_gpio);

  /* Re-init the port */

  s32k3xx_lpi2c_init(priv);

  /* Restore the frequency */

  s32k3xx_lpi2c_setclock(priv, frequency);
  ret = OK;

out:

  /* Release the port for reuse by other clients */

  nxmutex_unlock(&priv->lock);
  return ret;
}
#endif /* CONFIG_I2C_RESET */

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: s32k3xx_i2cbus_initialize
 *
 * Description:
 *   Initialize one I2C bus
 *
 ****************************************************************************/

struct i2c_master_s *s32k3xx_i2cbus_initialize(int port)
{
  struct s32k3xx_lpi2c_priv_s * priv = NULL;
  irqstate_t flags;

  /* Get I2C private structure */

  switch (port)
    {
#ifdef CONFIG_S32K3XX_LPI2C0
    case 0:
      priv = (struct s32k3xx_lpi2c_priv_s *)&s32k3xx_lpi2c0_priv;
      break;
#endif

#ifdef CONFIG_S32K3XX_LPI2C1
    case 1:
      priv = (struct s32k3xx_lpi2c_priv_s *)&s32k3xx_lpi2c1_priv;
      break;
#endif

    default:
      return NULL;
    }

  /* Initialize private data for the first time, increment reference count,
   * power-up hardware and configure GPIOs.
   */

  flags = enter_critical_section();

  if ((volatile int)priv->refs++ == 0)
    {
      s32k3xx_lpi2c_init(priv);

#ifdef CONFIG_S32K3XX_LPI2C_DMA
      if (priv->config->dma_txreqsrc != 0)
        {
          priv->txdma = s32k3xx_dmach_alloc(priv->config->dma_txreqsrc |
                                        DMAMUX_CHCFG_ENBL, 0);
          DEBUGASSERT(priv->txdma != NULL);
        }

      if (priv->config->dma_rxreqsrc != 0)
        {
          priv->rxdma = s32k3xx_dmach_alloc(priv->config->dma_rxreqsrc |
                                        DMAMUX_CHCFG_ENBL, 0);
          DEBUGASSERT(priv->rxdma != NULL);
        }
#endif
    }

  leave_critical_section(flags);

  return (struct i2c_master_s *)priv;
}

/****************************************************************************
 * Name: s32k3xx_i2cbus_uninitialize
 *
 * Description:
 *   Uninitialize an I2C bus
 *
 ****************************************************************************/

int s32k3xx_i2cbus_uninitialize(struct i2c_master_s *dev)
{
  struct s32k3xx_lpi2c_priv_s *priv = (struct s32k3xx_lpi2c_priv_s *)dev;
  irqstate_t flags;

  DEBUGASSERT(dev);

  /* Decrement reference count and check for underflow */

  if (priv->refs == 0)
    {
      return ERROR;
    }

  flags = enter_critical_section();

  if (--priv->refs > 0)
    {
      leave_critical_section(flags);
      return OK;
    }

  leave_critical_section(flags);

  /* Disable power and other HW resource (GPIO's) */

#ifdef CONFIG_S32K3XX_LPI2C_DMA
  if (priv->rxdma != NULL)
    {
      s32k3xx_dmach_stop(priv->rxdma);
      s32k3xx_dmach_free(priv->rxdma);
      priv->rxdma = NULL;
    }

  if (priv->txdma != NULL)
    {
      s32k3xx_dmach_stop(priv->txdma);
      s32k3xx_dmach_free(priv->txdma);
      priv->txdma = NULL;
    }
#endif

  s32k3xx_lpi2c_deinit(priv);

  return OK;
}

#endif /* CONFIG_S32K3XX_LPI2C */
